import whisper
import os
import pandas as pd
import pymorphy2 as pm2

keywords = {
    "банки": [
            "банк",
            "банковский",
            "кредит",
            "депозит",
            "вклад",
            "дебетовый",
            "кредитный",
            "дебетовая карта",
            "кредитная карта",
            "ипотека",
            "онлайн-банкинг",
            "мобильный банк",
            "перевод",
            "транзакция",
            "платежная система",
            "комиссия",
            "экономическая регулировка",
            "инвестиция",
            "кредитный договор",
            "договор с банком",
            "ставка",
            "банковский терминал",
            "брокер",
            "аналитик",
            "обмен",
            "страховка",
            "облигационный рынок",
            "сотрудники банка",
            "банковский контракт",
            "аналитика",
            "тенденция",
            "экономика",
            "банковская интеграция",
            "банковская репутация",
            "сбербанк",
            "втб",
            "газпромбанк",
            "альфа-банк",
            "росбанк",
            "тинькофф банк",
            "юникредит банк",
            "райффайзенбанк",
            "банк открытие",
            "промсвязьбанк",
            "россельхозбанк",
            "росгосстрах банк",
            "банк возрождение",
            "совкомбанк",
            "банк уралсиб",
            "московский кредитный банк",
            "русский стандарт",
            "почта банк",
            "россия",
            "бинбанк",
            "центрокредит банк",
            "ак барс банк",
            "банк зенит",
            "хоум кредит банк",
            "банк фк открытие",
            "банк дом.рф",
            "роскосмосбанк",
            "роснефть банк",
            "восточный банк",
            "мтс банк",
            "банк интеза",
            "югра",
            "банк ингосстрах",
            "банк приморье",
            "ситибанк",
            "траст",
            "росевробанк",
            "интеркоммерц банк",
            "банк кредит москва",
            "банк развития технологий",
            "союз",
            "кубань кредит",
            "проминвестбанк",
            "экспобанк",
            "фк открытие",
            "петрокоммерц",
            "росавтобанк",
            "банк сетелем",
            "русфинанс банк",
            "кэшбек",
            "tinkoff",
            ],
    "промо": [
            "реклама",
            "акция",
            "скидка",
            "спецпредложение",
            "распродажа",
            "бонус",
            "подарок",
            "лотерея",
            "розыгрыш",
            "конкурс",
            "промокод",
            "всего за",
            "всего лишь",
            "лояльность",
            "товар",
            "грамм",
            "килограмм",
            ],
    "имидж": [
            "имидж",
            "репутация",
            "брендинг",
            "позиционирование",
            "видение",
            "ценности",
            "культура",
            "лидерство",
            "команда",
            "экспертиза",
            "качество",
            "надежность",
            "отзывчивость",
            "уважение",
            "доверие",
            "ответственность",
            "устойчивость",
            "социальная ответственность",
            "экологическая ответственность",
            "финансовая ответственность",
            "кризисное управление",
            ],
    "социальные сети": [
            "подписываться",
            "отписываться",
            "лайкать",
            "репостить",
            "делиться",
            "комментировать",
            "подписаться",
            "отписаться",
            "поделиться",
            "лайкнуть",
            "комментировать",
            "репостнуть",
            "зарегистрироваться",
            "подписчик",
            "фолловер",
            "лайк",
            "подписка",
            "репост",
            "комментарий",
        ]
}

DATA_DIR = "/kaggle/input/mediawise-dataset-audio/"
morph = pm2.MorphAnalyzer(lang="ru")

def get_file_names(csv_file, table_header, data_dir):
    dir_files = os.listdir(data_dir)
    file_ids = pd.read_csv(csv_file)[table_header].tolist()
    file_names = [file_name for file_name in dir_files if any(str(file_id) in file_name for file_id in file_ids)]
    return file_names

def transcribe_file(model, data_dir, file_name):
    result = model.transcribe(data_dir + file_name)
    text = result["text"]
    return text.lower()

def get_word_lexemes(word):
    return [x.word for x in morph.parse(word)[0].lexeme]

def process_categories(text):
    categories = {category for category, words in keywords.items()
                  for word in words
                  for word_lexeme in get_word_lexemes(word)
                  if word_lexeme in text}
    return categories

def main():
    model = whisper.load_model("medium")
    file_names = get_file_names("/kaggle/input/asdkfsakfjsaf/train_segments.csv", "Advertisement ID", DATA_DIR)
    for file_name in file_names:
        text = transcribe_file(model, DATA_DIR, file_name)
        categories = process_categories(text)
        print(file_name, categories)

if __name__ == "__main__":
    main()
